{"format": "graph-model", "generatedBy": "1.14.0", "convertedBy": "TensorFlow.js Converter v1.2.6", "modelTopology": {"node": [{"name": "module_apply_default/Logits/act_quant/max", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}}}, {"name": "module_apply_default/Logits/act_quant/min", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "module_apply_default/Logits/biases", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "965"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "module_apply_default/Logits/weights_quant/FakeQuantWithMinMaxVars", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1280"}, {"size": "965"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "module_apply_default/Flatten/flatten/Reshape/shape/1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "module_apply_default/Flatten/flatten/strided_slice/stack_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "module_apply_default/Flatten/flatten/strided_slice/stack", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "module_apply_default/MobilenetV2/expanded_conv_15/expand/act_quant/max", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "module_apply_default/MobilenetV2/expanded_conv_15/expand/act_quant/min", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "module_apply_default/MobilenetV2/Conv_1/weights_quant/FakeQuantWithMinMaxVars", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "320"}, {"size": "1280"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "module_apply_default/MobilenetV2/expanded_conv_16/project/act_quant/max", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "module_apply_default/MobilenetV2/expanded_conv_16/project/act_quant/min", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "module_apply_default/MobilenetV2/expanded_conv_16/project/weights_quant/FakeQuantWithMinMaxVars", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "960"}, {"size": "320"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "module_apply_default/MobilenetV2/expanded_conv_16/depthwise/weights_quant/FakeQuantWithMinMaxVars", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "960"}, {"size": "1"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "module_apply_default/MobilenetV2/expanded_conv_16/expand/weights_quant/FakeQuantWithMinMaxVars", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "160"}, {"size": "960"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "module_apply_default/MobilenetV2/expanded_conv_15/post_activation_bypass_quant/max", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}}}, {"name": "module_apply_default/MobilenetV2/expanded_conv_15/post_activation_bypass_quant/min", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "module_apply_default/MobilenetV2/expanded_conv_15/project/act_quant/max", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "module_apply_default/MobilenetV2/expanded_conv_15/project/act_quant/min", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}}}, {"name": "module_apply_default/MobilenetV2/expanded_conv_15/project/weights_quant/FakeQuantWithMinMaxVars", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "960"}, {"size": "160"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "module_apply_default/MobilenetV2/expanded_conv_15/depthwise/weights_quant/FakeQuantWithMinMaxVars", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "960"}, {"size": "1"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "module_apply_default/MobilenetV2/expanded_conv_15/expand/weights_quant/FakeQuantWithMinMaxVars", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "160"}, {"size": "960"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "module_apply_default/MobilenetV2/expanded_conv_14/post_activation_bypass_quant/max", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "module_apply_default/MobilenetV2/expanded_conv_14/post_activation_bypass_quant/min", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "module_apply_default/MobilenetV2/expanded_conv_14/project/act_quant/max", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "module_apply_default/MobilenetV2/expanded_conv_14/project/act_quant/min", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "module_apply_default/MobilenetV2/expanded_conv_14/project/weights_quant/FakeQuantWithMinMaxVars", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "960"}, {"size": "160"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "module_apply_default/MobilenetV2/expanded_conv_14/depthwise/weights_quant/FakeQuantWithMinMaxVars", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "960"}, {"size": "1"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "module_apply_default/MobilenetV2/expanded_conv_14/expand/weights_quant/FakeQuantWithMinMaxVars", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "160"}, {"size": "960"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "module_apply_default/MobilenetV2/expanded_conv_13/project/act_quant/max", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "module_apply_default/MobilenetV2/expanded_conv_13/project/act_quant/min", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "module_apply_default/MobilenetV2/expanded_conv_13/project/weights_quant/FakeQuantWithMinMaxVars", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "576"}, {"size": "160"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "module_apply_default/MobilenetV2/expanded_conv_13/depthwise/weights_quant/FakeQuantWithMinMaxVars", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "576"}, {"size": "1"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "module_apply_default/MobilenetV2/expanded_conv_13/expand/weights_quant/FakeQuantWithMinMaxVars", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "96"}, {"size": "576"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "module_apply_default/MobilenetV2/expanded_conv_12/post_activation_bypass_quant/max", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "module_apply_default/MobilenetV2/expanded_conv_12/post_activation_bypass_quant/min", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "module_apply_default/MobilenetV2/expanded_conv_12/project/act_quant/max", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "module_apply_default/MobilenetV2/expanded_conv_12/project/act_quant/min", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "module_apply_default/MobilenetV2/expanded_conv_12/project/weights_quant/FakeQuantWithMinMaxVars", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "576"}, {"size": "96"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "module_apply_default/MobilenetV2/expanded_conv_12/depthwise/weights_quant/FakeQuantWithMinMaxVars", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "576"}, {"size": "1"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "module_apply_default/MobilenetV2/expanded_conv_12/expand/weights_quant/FakeQuantWithMinMaxVars", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "96"}, {"size": "576"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "module_apply_default/MobilenetV2/expanded_conv_11/post_activation_bypass_quant/max", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "module_apply_default/MobilenetV2/expanded_conv_11/post_activation_bypass_quant/min", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "module_apply_default/MobilenetV2/expanded_conv_11/project/act_quant/max", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}}}, {"name": "module_apply_default/MobilenetV2/expanded_conv_11/project/act_quant/min", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "module_apply_default/MobilenetV2/expanded_conv_11/project/weights_quant/FakeQuantWithMinMaxVars", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "576"}, {"size": "96"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "module_apply_default/MobilenetV2/expanded_conv_11/depthwise/weights_quant/FakeQuantWithMinMaxVars", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "576"}, {"size": "1"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "module_apply_default/MobilenetV2/expanded_conv_11/expand/weights_quant/FakeQuantWithMinMaxVars", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "96"}, {"size": "576"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "module_apply_default/MobilenetV2/expanded_conv_10/project/act_quant/max", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "module_apply_default/MobilenetV2/expanded_conv_10/project/act_quant/min", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "module_apply_default/MobilenetV2/expanded_conv_10/project/weights_quant/FakeQuantWithMinMaxVars", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "384"}, {"size": "96"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "module_apply_default/MobilenetV2/expanded_conv_10/depthwise/weights_quant/FakeQuantWithMinMaxVars", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "384"}, {"size": "1"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "module_apply_default/MobilenetV2/expanded_conv_10/expand/weights_quant/FakeQuantWithMinMaxVars", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "64"}, {"size": "384"}]}}}}}, {"name": "module_apply_default/MobilenetV2/expanded_conv_9/post_activation_bypass_quant/max", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "module_apply_default/MobilenetV2/expanded_conv_9/post_activation_bypass_quant/min", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "module_apply_default/MobilenetV2/expanded_conv_9/project/act_quant/max", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "module_apply_default/MobilenetV2/expanded_conv_9/project/act_quant/min", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "module_apply_default/MobilenetV2/expanded_conv_9/project/weights_quant/FakeQuantWithMinMaxVars", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "384"}, {"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "module_apply_default/MobilenetV2/expanded_conv_9/depthwise/weights_quant/FakeQuantWithMinMaxVars", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "384"}, {"size": "1"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "module_apply_default/MobilenetV2/expanded_conv_9/expand/weights_quant/FakeQuantWithMinMaxVars", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "64"}, {"size": "384"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "module_apply_default/MobilenetV2/expanded_conv_8/post_activation_bypass_quant/max", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "module_apply_default/MobilenetV2/expanded_conv_8/post_activation_bypass_quant/min", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "module_apply_default/MobilenetV2/expanded_conv_8/project/act_quant/max", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "module_apply_default/MobilenetV2/expanded_conv_8/project/act_quant/min", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "module_apply_default/MobilenetV2/expanded_conv_8/project/weights_quant/FakeQuantWithMinMaxVars", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "384"}, {"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "module_apply_default/MobilenetV2/expanded_conv_8/depthwise/weights_quant/FakeQuantWithMinMaxVars", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "384"}, {"size": "1"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "module_apply_default/MobilenetV2/expanded_conv_8/expand/weights_quant/FakeQuantWithMinMaxVars", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "64"}, {"size": "384"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "module_apply_default/MobilenetV2/expanded_conv_7/post_activation_bypass_quant/max", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "module_apply_default/MobilenetV2/expanded_conv_7/post_activation_bypass_quant/min", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "module_apply_default/MobilenetV2/expanded_conv_7/project/act_quant/max", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "module_apply_default/MobilenetV2/expanded_conv_7/project/act_quant/min", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "module_apply_default/MobilenetV2/expanded_conv_7/project/weights_quant/FakeQuantWithMinMaxVars", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "384"}, {"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "module_apply_default/MobilenetV2/expanded_conv_7/depthwise/weights_quant/FakeQuantWithMinMaxVars", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "384"}, {"size": "1"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "module_apply_default/MobilenetV2/expanded_conv_7/expand/weights_quant/FakeQuantWithMinMaxVars", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "64"}, {"size": "384"}]}}}}}, {"name": "module_apply_default/MobilenetV2/expanded_conv_6/project/act_quant/max", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "module_apply_default/MobilenetV2/expanded_conv_6/project/act_quant/min", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "module_apply_default/MobilenetV2/expanded_conv_6/project/weights_quant/FakeQuantWithMinMaxVars", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "192"}, {"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "module_apply_default/MobilenetV2/expanded_conv_6/depthwise/weights_quant/FakeQuantWithMinMaxVars", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "192"}, {"size": "1"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "module_apply_default/MobilenetV2/expanded_conv_6/expand/weights_quant/FakeQuantWithMinMaxVars", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "32"}, {"size": "192"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "module_apply_default/MobilenetV2/expanded_conv_5/post_activation_bypass_quant/max", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}}}, {"name": "module_apply_default/MobilenetV2/expanded_conv_5/post_activation_bypass_quant/min", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "module_apply_default/MobilenetV2/expanded_conv_5/project/act_quant/max", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "module_apply_default/MobilenetV2/expanded_conv_5/project/act_quant/min", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "module_apply_default/MobilenetV2/expanded_conv_5/project/weights_quant/FakeQuantWithMinMaxVars", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "192"}, {"size": "32"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "module_apply_default/MobilenetV2/expanded_conv_5/depthwise/weights_quant/FakeQuantWithMinMaxVars", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "192"}, {"size": "1"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "module_apply_default/MobilenetV2/expanded_conv_5/expand/weights_quant/FakeQuantWithMinMaxVars", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "32"}, {"size": "192"}]}}}}}, {"name": "module_apply_default/MobilenetV2/expanded_conv_4/post_activation_bypass_quant/max", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "module_apply_default/MobilenetV2/expanded_conv_4/post_activation_bypass_quant/min", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "module_apply_default/MobilenetV2/expanded_conv_4/project/act_quant/max", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "module_apply_default/MobilenetV2/expanded_conv_4/project/act_quant/min", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "module_apply_default/MobilenetV2/expanded_conv_4/project/weights_quant/FakeQuantWithMinMaxVars", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "192"}, {"size": "32"}]}}}}}, {"name": "module_apply_default/MobilenetV2/expanded_conv_4/depthwise/weights_quant/FakeQuantWithMinMaxVars", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "192"}, {"size": "1"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "module_apply_default/MobilenetV2/expanded_conv_4/expand/weights_quant/FakeQuantWithMinMaxVars", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "32"}, {"size": "192"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "module_apply_default/MobilenetV2/expanded_conv_3/project/act_quant/max", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "module_apply_default/MobilenetV2/expanded_conv_3/project/act_quant/min", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "module_apply_default/MobilenetV2/expanded_conv_3/project/weights_quant/FakeQuantWithMinMaxVars", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "144"}, {"size": "32"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "module_apply_default/MobilenetV2/expanded_conv_3/depthwise/weights_quant/FakeQuantWithMinMaxVars", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "144"}, {"size": "1"}]}}}}}, {"name": "module_apply_default/MobilenetV2/expanded_conv_3/expand/weights_quant/FakeQuantWithMinMaxVars", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "24"}, {"size": "144"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "module_apply_default/MobilenetV2/expanded_conv_2/post_activation_bypass_quant/max", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "module_apply_default/MobilenetV2/expanded_conv_2/post_activation_bypass_quant/min", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "module_apply_default/MobilenetV2/expanded_conv_2/project/act_quant/max", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "module_apply_default/MobilenetV2/expanded_conv_2/project/act_quant/min", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "module_apply_default/MobilenetV2/expanded_conv_2/project/weights_quant/FakeQuantWithMinMaxVars", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "144"}, {"size": "24"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "module_apply_default/MobilenetV2/expanded_conv_2/depthwise/weights_quant/FakeQuantWithMinMaxVars", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "144"}, {"size": "1"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "module_apply_default/MobilenetV2/expanded_conv_2/expand/weights_quant/FakeQuantWithMinMaxVars", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "24"}, {"size": "144"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "module_apply_default/MobilenetV2/expanded_conv_1/project/act_quant/max", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "module_apply_default/MobilenetV2/expanded_conv_1/project/act_quant/min", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "module_apply_default/MobilenetV2/expanded_conv_1/project/weights_quant/FakeQuantWithMinMaxVars", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "96"}, {"size": "24"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "module_apply_default/MobilenetV2/expanded_conv_1/depthwise/weights_quant/FakeQuantWithMinMaxVars", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "96"}, {"size": "1"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "module_apply_default/MobilenetV2/expanded_conv_1/expand/weights_quant/FakeQuantWithMinMaxVars", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "16"}, {"size": "96"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "module_apply_default/MobilenetV2/expanded_conv/project/act_quant/max", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "module_apply_default/MobilenetV2/expanded_conv/project/act_quant/min", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "module_apply_default/MobilenetV2/expanded_conv/project/weights_quant/FakeQuantWithMinMaxVars", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "32"}, {"size": "16"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "module_apply_default/MobilenetV2/expanded_conv/depthwise/weights_quant/FakeQuantWithMinMaxVars", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "32"}, {"size": "1"}]}}}}}, {"name": "module_apply_default/MobilenetV2/Conv/act_quant/max", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "module_apply_default/MobilenetV2/Conv/weights_quant/FakeQuantWithMinMaxVars", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "3"}, {"size": "32"}]}}}}}, {"name": "module_apply_default/hub_input/Sub/y", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "module_apply_default/hub_input/Mul/y", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "images", "op": "Placeholder", "attr": {"dtype": {"type": "DT_FLOAT"}, "shape": {"shape": {"dim": [{"size": "-1"}, {"size": "224"}, {"size": "224"}, {"size": "3"}]}}}}, {"name": "module_apply_default/MobilenetV2/Conv/BatchNorm_Fold/bias", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "32"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "module_apply_default/MobilenetV2/expanded_conv/depthwise/BatchNorm_Fold/bias", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "32"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "module_apply_default/MobilenetV2/expanded_conv/project/BatchNorm_Fold/bias", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "16"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "module_apply_default/MobilenetV2/expanded_conv_1/expand/BatchNorm_Fold/bias", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "96"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "module_apply_default/MobilenetV2/expanded_conv_1/depthwise/BatchNorm_Fold/bias", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "96"}]}}}}}, {"name": "module_apply_default/MobilenetV2/expanded_conv_1/project/BatchNorm_Fold/bias", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "24"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "module_apply_default/MobilenetV2/expanded_conv_2/expand/BatchNorm_Fold/bias", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "144"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "module_apply_default/MobilenetV2/expanded_conv_2/depthwise/BatchNorm_Fold/bias", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "144"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "module_apply_default/MobilenetV2/expanded_conv_2/project/BatchNorm_Fold/bias", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "24"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "module_apply_default/MobilenetV2/expanded_conv_3/expand/BatchNorm_Fold/bias", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "144"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "module_apply_default/MobilenetV2/expanded_conv_3/depthwise/BatchNorm_Fold/bias", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "144"}]}}}}}, {"name": "module_apply_default/MobilenetV2/expanded_conv_3/project/BatchNorm_Fold/bias", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "32"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "module_apply_default/MobilenetV2/expanded_conv_4/expand/BatchNorm_Fold/bias", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "192"}]}}}}}, {"name": "module_apply_default/MobilenetV2/expanded_conv_4/depthwise/BatchNorm_Fold/bias", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "192"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "module_apply_default/MobilenetV2/expanded_conv_4/project/BatchNorm_Fold/bias", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "32"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "module_apply_default/MobilenetV2/expanded_conv_5/expand/BatchNorm_Fold/bias", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "192"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "module_apply_default/MobilenetV2/expanded_conv_5/depthwise/BatchNorm_Fold/bias", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "192"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "module_apply_default/MobilenetV2/expanded_conv_5/project/BatchNorm_Fold/bias", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "32"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "module_apply_default/MobilenetV2/expanded_conv_6/expand/BatchNorm_Fold/bias", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "192"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "module_apply_default/MobilenetV2/expanded_conv_6/depthwise/BatchNorm_Fold/bias", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "192"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "module_apply_default/MobilenetV2/expanded_conv_6/project/BatchNorm_Fold/bias", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "module_apply_default/MobilenetV2/expanded_conv_7/expand/BatchNorm_Fold/bias", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "384"}]}}}}}, {"name": "module_apply_default/MobilenetV2/expanded_conv_7/depthwise/BatchNorm_Fold/bias", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "384"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "module_apply_default/MobilenetV2/expanded_conv_7/project/BatchNorm_Fold/bias", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "module_apply_default/MobilenetV2/expanded_conv_8/expand/BatchNorm_Fold/bias", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "384"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "module_apply_default/MobilenetV2/expanded_conv_8/depthwise/BatchNorm_Fold/bias", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "384"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "module_apply_default/MobilenetV2/expanded_conv_8/project/BatchNorm_Fold/bias", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "module_apply_default/MobilenetV2/expanded_conv_9/expand/BatchNorm_Fold/bias", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "384"}]}}}}}, {"name": "module_apply_default/MobilenetV2/expanded_conv_9/depthwise/BatchNorm_Fold/bias", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "384"}]}}}}}, {"name": "module_apply_default/MobilenetV2/expanded_conv_9/project/BatchNorm_Fold/bias", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "module_apply_default/MobilenetV2/expanded_conv_10/expand/BatchNorm_Fold/bias", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "384"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "module_apply_default/MobilenetV2/expanded_conv_10/depthwise/BatchNorm_Fold/bias", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "384"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "module_apply_default/MobilenetV2/expanded_conv_10/project/BatchNorm_Fold/bias", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "96"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "module_apply_default/MobilenetV2/expanded_conv_11/expand/BatchNorm_Fold/bias", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "576"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "module_apply_default/MobilenetV2/expanded_conv_11/depthwise/BatchNorm_Fold/bias", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "576"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "module_apply_default/MobilenetV2/expanded_conv_11/project/BatchNorm_Fold/bias", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "96"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "module_apply_default/MobilenetV2/expanded_conv_12/expand/BatchNorm_Fold/bias", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "576"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "module_apply_default/MobilenetV2/expanded_conv_12/depthwise/BatchNorm_Fold/bias", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "576"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "module_apply_default/MobilenetV2/expanded_conv_12/project/BatchNorm_Fold/bias", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "96"}]}}}}}, {"name": "module_apply_default/MobilenetV2/expanded_conv_13/expand/BatchNorm_Fold/bias", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "576"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "module_apply_default/MobilenetV2/expanded_conv_13/depthwise/BatchNorm_Fold/bias", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "576"}]}}}}}, {"name": "module_apply_default/MobilenetV2/expanded_conv_13/project/BatchNorm_Fold/bias", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "160"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "module_apply_default/MobilenetV2/expanded_conv_14/expand/BatchNorm_Fold/bias", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "960"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "module_apply_default/MobilenetV2/expanded_conv_14/depthwise/BatchNorm_Fold/bias", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "960"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "module_apply_default/MobilenetV2/expanded_conv_14/project/BatchNorm_Fold/bias", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "160"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "module_apply_default/MobilenetV2/expanded_conv_15/expand/BatchNorm_Fold/bias", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "960"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "module_apply_default/MobilenetV2/expanded_conv_15/depthwise/BatchNorm_Fold/bias", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "960"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "module_apply_default/MobilenetV2/expanded_conv_15/project/BatchNorm_Fold/bias", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "160"}]}}}}}, {"name": "module_apply_default/MobilenetV2/expanded_conv_16/expand/BatchNorm_Fold/bias", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "960"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "module_apply_default/MobilenetV2/expanded_conv_16/depthwise/BatchNorm_Fold/bias", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "960"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "module_apply_default/MobilenetV2/expanded_conv_16/project/BatchNorm_Fold/bias", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "320"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "module_apply_default/MobilenetV2/Conv_1/BatchNorm_Fold/bias", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1280"}]}}}}}, {"name": "module_apply_default/hub_input/Mul", "op": "Mul", "input": ["images", "module_apply_default/hub_input/Mul/y"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "module_apply_default/hub_input/Sub", "op": "Sub", "input": ["module_apply_default/hub_input/Mul", "module_apply_default/hub_input/Sub/y"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "module_apply_default/MobilenetV2/Conv/Conv2D_Fold", "op": "Conv2D", "input": ["module_apply_default/hub_input/Sub", "module_apply_default/MobilenetV2/Conv/weights_quant/FakeQuantWithMinMaxVars"], "attr": {"dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkhXQw=="}, "strides": {"list": {"i": ["1", "2", "2", "1"]}}, "use_cudnn_on_gpu": {"b": true}, "explicit_paddings": {"list": {}}, "padding": {"s": "U0FNRQ=="}}}, {"name": "module_apply_default/MobilenetV2/Conv/add_fold", "op": "Add", "input": ["module_apply_default/MobilenetV2/Conv/BatchNorm_Fold/bias", "module_apply_default/MobilenetV2/Conv/Conv2D_Fold"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "module_apply_default/MobilenetV2/Conv/Relu6", "op": "Relu6", "input": ["module_apply_default/MobilenetV2/Conv/add_fold"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "module_apply_default/MobilenetV2/Conv/act_quant/FakeQuantWithMinMaxVars", "op": "FakeQuantWithMinMaxVars", "input": ["module_apply_default/MobilenetV2/Conv/Relu6", "module_apply_default/MobilenetV2/expanded_conv_15/expand/act_quant/min", "module_apply_default/MobilenetV2/Conv/act_quant/max"], "attr": {"num_bits": {"i": "8"}, "narrow_range": {"b": false}}}, {"name": "module_apply_default/MobilenetV2/expanded_conv/depthwise/depthwise_Fold", "op": "DepthwiseConv2dNative", "input": ["module_apply_default/MobilenetV2/Conv/act_quant/FakeQuantWithMinMaxVars", "module_apply_default/MobilenetV2/expanded_conv/depthwise/weights_quant/FakeQuantWithMinMaxVars"], "attr": {"dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "padding": {"s": "U0FNRQ=="}, "T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkhXQw=="}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}}}, {"name": "module_apply_default/MobilenetV2/expanded_conv/depthwise/add_fold", "op": "Add", "input": ["module_apply_default/MobilenetV2/expanded_conv/depthwise/BatchNorm_Fold/bias", "module_apply_default/MobilenetV2/expanded_conv/depthwise/depthwise_Fold"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "module_apply_default/MobilenetV2/expanded_conv/depthwise/Relu6", "op": "Relu6", "input": ["module_apply_default/MobilenetV2/expanded_conv/depthwise/add_fold"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "module_apply_default/MobilenetV2/expanded_conv/depthwise/act_quant/FakeQuantWithMinMaxVars", "op": "FakeQuantWithMinMaxVars", "input": ["module_apply_default/MobilenetV2/expanded_conv/depthwise/Relu6", "module_apply_default/MobilenetV2/expanded_conv_15/expand/act_quant/min", "module_apply_default/MobilenetV2/expanded_conv_15/expand/act_quant/max"], "attr": {"num_bits": {"i": "8"}, "narrow_range": {"b": false}}}, {"name": "module_apply_default/MobilenetV2/expanded_conv/project/Conv2D_Fold", "op": "Conv2D", "input": ["module_apply_default/MobilenetV2/expanded_conv/depthwise/act_quant/FakeQuantWithMinMaxVars", "module_apply_default/MobilenetV2/expanded_conv/project/weights_quant/FakeQuantWithMinMaxVars"], "attr": {"dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "data_format": {"s": "TkhXQw=="}, "use_cudnn_on_gpu": {"b": true}, "explicit_paddings": {"list": {}}, "padding": {"s": "U0FNRQ=="}}}, {"name": "module_apply_default/MobilenetV2/expanded_conv/project/add_fold", "op": "Add", "input": ["module_apply_default/MobilenetV2/expanded_conv/project/BatchNorm_Fold/bias", "module_apply_default/MobilenetV2/expanded_conv/project/Conv2D_Fold"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "module_apply_default/MobilenetV2/expanded_conv/project/act_quant/FakeQuantWithMinMaxVars", "op": "FakeQuantWithMinMaxVars", "input": ["module_apply_default/MobilenetV2/expanded_conv/project/add_fold", "module_apply_default/MobilenetV2/expanded_conv/project/act_quant/min", "module_apply_default/MobilenetV2/expanded_conv/project/act_quant/max"], "attr": {"num_bits": {"i": "8"}, "narrow_range": {"b": false}}}, {"name": "module_apply_default/MobilenetV2/expanded_conv_1/expand/Conv2D_Fold", "op": "Conv2D", "input": ["module_apply_default/MobilenetV2/expanded_conv/project/act_quant/FakeQuantWithMinMaxVars", "module_apply_default/MobilenetV2/expanded_conv_1/expand/weights_quant/FakeQuantWithMinMaxVars"], "attr": {"use_cudnn_on_gpu": {"b": true}, "explicit_paddings": {"list": {}}, "padding": {"s": "U0FNRQ=="}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkhXQw=="}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}}}, {"name": "module_apply_default/MobilenetV2/expanded_conv_1/expand/add_fold", "op": "Add", "input": ["module_apply_default/MobilenetV2/expanded_conv_1/expand/BatchNorm_Fold/bias", "module_apply_default/MobilenetV2/expanded_conv_1/expand/Conv2D_Fold"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "module_apply_default/MobilenetV2/expanded_conv_1/expand/Relu6", "op": "Relu6", "input": ["module_apply_default/MobilenetV2/expanded_conv_1/expand/add_fold"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "module_apply_default/MobilenetV2/expanded_conv_1/expand/act_quant/FakeQuantWithMinMaxVars", "op": "FakeQuantWithMinMaxVars", "input": ["module_apply_default/MobilenetV2/expanded_conv_1/expand/Relu6", "module_apply_default/MobilenetV2/expanded_conv_15/expand/act_quant/min", "module_apply_default/MobilenetV2/expanded_conv_15/expand/act_quant/max"], "attr": {"num_bits": {"i": "8"}, "narrow_range": {"b": false}}}, {"name": "module_apply_default/MobilenetV2/expanded_conv_1/depthwise/depthwise_Fold", "op": "DepthwiseConv2dNative", "input": ["module_apply_default/MobilenetV2/expanded_conv_1/expand/act_quant/FakeQuantWithMinMaxVars", "module_apply_default/MobilenetV2/expanded_conv_1/depthwise/weights_quant/FakeQuantWithMinMaxVars"], "attr": {"padding": {"s": "U0FNRQ=="}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkhXQw=="}, "strides": {"list": {"i": ["1", "2", "2", "1"]}}}}, {"name": "module_apply_default/MobilenetV2/expanded_conv_1/depthwise/add_fold", "op": "Add", "input": ["module_apply_default/MobilenetV2/expanded_conv_1/depthwise/BatchNorm_Fold/bias", "module_apply_default/MobilenetV2/expanded_conv_1/depthwise/depthwise_Fold"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "module_apply_default/MobilenetV2/expanded_conv_1/depthwise/Relu6", "op": "Relu6", "input": ["module_apply_default/MobilenetV2/expanded_conv_1/depthwise/add_fold"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "module_apply_default/MobilenetV2/expanded_conv_1/depthwise/act_quant/FakeQuantWithMinMaxVars", "op": "FakeQuantWithMinMaxVars", "input": ["module_apply_default/MobilenetV2/expanded_conv_1/depthwise/Relu6", "module_apply_default/MobilenetV2/expanded_conv_15/expand/act_quant/min", "module_apply_default/MobilenetV2/expanded_conv_15/expand/act_quant/max"], "attr": {"num_bits": {"i": "8"}, "narrow_range": {"b": false}}}, {"name": "module_apply_default/MobilenetV2/expanded_conv_1/project/Conv2D_Fold", "op": "Conv2D", "input": ["module_apply_default/MobilenetV2/expanded_conv_1/depthwise/act_quant/FakeQuantWithMinMaxVars", "module_apply_default/MobilenetV2/expanded_conv_1/project/weights_quant/FakeQuantWithMinMaxVars"], "attr": {"padding": {"s": "U0FNRQ=="}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkhXQw=="}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "use_cudnn_on_gpu": {"b": true}, "explicit_paddings": {"list": {}}}}, {"name": "module_apply_default/MobilenetV2/expanded_conv_1/project/add_fold", "op": "Add", "input": ["module_apply_default/MobilenetV2/expanded_conv_1/project/BatchNorm_Fold/bias", "module_apply_default/MobilenetV2/expanded_conv_1/project/Conv2D_Fold"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "module_apply_default/MobilenetV2/expanded_conv_1/project/act_quant/FakeQuantWithMinMaxVars", "op": "FakeQuantWithMinMaxVars", "input": ["module_apply_default/MobilenetV2/expanded_conv_1/project/add_fold", "module_apply_default/MobilenetV2/expanded_conv_1/project/act_quant/min", "module_apply_default/MobilenetV2/expanded_conv_1/project/act_quant/max"], "attr": {"num_bits": {"i": "8"}, "narrow_range": {"b": false}}}, {"name": "module_apply_default/MobilenetV2/expanded_conv_2/expand/Conv2D_Fold", "op": "Conv2D", 